In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("sales_subset.csv" , index_col = 0)
df.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [3]:
df.describe()

,store,department,weekly_sales,temperature_c,fuel_price_usd_per_l,unemployment
count,10774.000000,10774.000000,10774.000000,10774.000000,10774.000000,10774.000000
mean,15.441897,45.218118,23843.950149,15.731978,0.749746,8.082009
std,11.534511,29.867779,30220.387557,9.922446,0.059494,0.624355
min,1.000000,1.000000,-1098.000000,-8.366667,0.664129,3.879000
25%,4.000000,20.000000,3867.115000,7.583333,0.708246,7.795000
50%,13.000000,40.000000,12049.065000,16.966667,0.743381,8.099000
75%,20.000000,72.000000,32349.850000,24.166667,0.781421,8.360000
max,39.000000,99.000000,293966.050000,33.827778,1.107674,9.765000

In [10]:
df["type"].unique()

array(['A', 'B'], dtype=object)

In [13]:
df["type"].value_counts()

type
A    9872
B     902
Name: count, dtype: int64

In [16]:
total_sum = df["weekly_sales"].unique().sum()
total_sum

256646812.55

In [17]:
sales_A = df[df["type"] == "A"]["weekly_sales"].sum()
(sales_A / total_sum) * 100

91.06534879113968

In [19]:
sales_B = df[df["type"] == "B"]["weekly_sales"].sum()
(sales_B / total_sum) * 100

9.031245570402078

In [20]:
group_sales = df.groupby("type")["weekly_sales"].sum()
(group_sales / total_sum) * 100

type
A    91.065349
B     9.031246
Name: weekly_sales, dtype: float64